---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamElemCorruption
source: html/a100af4b-4da1-73ba-ef0b-b69b2e2593b0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamElemCorruption Property

Family contains invalid elements. They will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingBadFamElemCorruption { get; }
```